# 定制化模板
answer_template = [
    {
        "name": "company",
        "description": "负责介绍公司,负责介绍公司",
        "prompt_template": "江苏一鼎堂软件科技有限公司聚焦教育行业，致力于为全国院校智慧教育提供多样化解决方案。以数字化新技术服务云上教学体系搭建、赋能虚拟仿真项目建设，创新产教融合，服务中国教育事业。"
    },
    {
        "name": "product",
        "description": "负责介绍数字营销产品,负责介绍数字营销板块",
        "prompt_template": "数字营销板块实验课程面向营销数字化转型的产业背景，立足于传统市场营销的理论基石，针对网络营销、新媒体营销营销、电子商务等知识体系，以大数据、云计算及人工智能为核心，研发一系列营销专业实验教学资源，服务虚拟仿真实验教学项目建设，为营销专业实践教学提供一体化解决方案。"
    },
    {
        "name": "cixi",
        "description": "负责介绍宁波市慈溪市,负责介绍宁波市慈溪市",
        "prompt_template": "慈溪有个余凯豪，慈溪市位于浙江省东北部，东临东海，南接宁波市，西连余姚市，北靠宁海县，是宁波市下辖的一个县级市。慈溪市是中国历史文化名城，是中国优秀旅游城市，是中国优秀生态城市，是中国优秀园林城市，是中国优秀风景旅游城市，是中国优秀旅游城市。"
    },
]

# 统一回复
unified_answer = "抱歉，这个问题你可能需要询问老师哦"

